BaseConfiguration/Money_2_0/InformationRegisters/Расписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Расписания</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияРасписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеРасписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПовторовСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокДнейНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонДнейНедели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонНомеровМесяцев</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонЧиселМесяца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецРасписания</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ДатыРасписаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДатыРасписаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АктуальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютаРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановаяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДохода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасхода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВладелецРасписания</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ОперацииШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОперацииШаблонов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбменВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводИзменениеОстатка</v8:Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВзялиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.НамВернулиДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.МыДалиВДолг</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.УниверсальнаяОперация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/Расписания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


// Выполняет проверку корректности записей, исправляет ошибки
Процедура ПерезаписатьШаблоны() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Различные
	|	Расписания.ВладелецРасписания КАК ВладелецРасписания
	|ИЗ
	|	РегистрСведений.Расписания КАК Расписания";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДокОбъект = ?(Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВладелецРасписания), 
				Неопределено, 
				ВыборкаДетальныеЗаписи.ВладелецРасписания.ПолучитьОбъект());
				
		Если ДокОбъект = Неопределено Тогда
			// Шаблон был удален без очистки связанных регистров или из обмена были получены некорректные данные
			Попытка
				Запись = РегистрыСведений.Расписания.СоздатьМенеджерЗаписи();
				Запись.ВладелецРасписания = ВыборкаДетальныеЗаписи.ВладелецРасписания;
				Запись.Удалить();
				
				Набор = РегистрыСведений.ДатыРасписаний.СоздатьНаборЗаписей();
				Набор.Отбор.ВладелецРасписания.Установить(ВыборкаДетальныеЗаписи.ВладелецРасписания);
				Набор.Записать(Истина);
				
				Набор = РегистрыСведений.ОперацииШаблонов.СоздатьНаборЗаписей();
				Набор.Отбор.Шаблон.Установить(ВыборкаДетальныеЗаписи.ВладелецРасписания);
				Набор.Записать(Истина);
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВладелецРасписания) Тогда
					Набор = РегистрыНакопления.ОборотыПлановыхОпераций.СоздатьНаборЗаписей();
					Набор.Отбор.Регистратор.Установить(ВыборкаДетальныеЗаписи.ВладелецРасписания);
					Набор.Записать(Истина);
				КонецЕсли;
				
			Исключение
				
				ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,
					ВыборкаДетальныеЗаписи.ВладелецРасписания,
					СтрШаблон("Не удалось очистить запись расписания для владельца ""%1"" (2)
					|%2", 
						ВыборкаДетальныеЗаписи.ВладелецРасписания, 
						ТипЗнч(ВыборкаДетальныеЗаписи.ВладелецРасписания), 
						ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
					);
				
			КонецПопытки;
			
		Иначе
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расписания.ВладелецРасписания
	|ИЗ
	|	РегистрСведений.Расписания КАК Расписания
	|ГДЕ
	|	Расписания.ВладелецРасписания.Ссылка ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Не ЗначениеЗаполнено(Выборка.ВладелецРасписания) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Набор = РегистрыСведений.Расписания.СоздатьНаборЗаписей();
			Набор.Отбор.ВладелецРасписания.Установить(Выборка.ВладелецРасписания);
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон("Не удалось очистить записи расписания для владельца ""%1""
				|%2", Выборка.ВладелецРасписания, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
				);
		КонецПопытки;
		
		Попытка
			Набор = РегистрыНакопления.ОборотыПлановыхОпераций.СоздатьНаборЗаписей();
			Набор.Отбор.Регистратор.Установить(Выборка.ВладелецРасписания);
			Набор.Записать(Истина);
		Исключение
			БылиОшибки = Истина;
			ЗаписьЖурналаРегистрации("Плановые операции", УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон("Не удалось очистить обороты плановых операций для владельца ""%1""
				|%2", Выборка.ВладелецРасписания, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()))
				);
		КонецПопытки;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
